name:"UNET"
layer {
  name: "data"
  type: "HDF5Data"
  top: "img"
  top: "mask"
  include {
    phase: TRAIN
  }
  hdf5_data_param {
    source: "./data/train/train_shuffle.txt"
    batch_size: 16
    shuffle: true
  }
}



layer {
  name: "data"
  type: "HDF5Data"
  top: "img"
  top: "mask"
  include {
    phase: TEST
  } 
  hdf5_data_param {
    source: "./data/train/test_shuffle.txt"
    batch_size: 16
    shuffle: true
  }
}

layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "img"
  top: "conv1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 16
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu1"
  type:"ReLU"
  bottom:"conv1_1"
  top:"conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu2"
  type:"ReLU"
  bottom:"conv1_2"
  top:"conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu3"
  type:"ReLU"
  bottom:"conv2_1"
  top:"conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu4"
  type:"ReLU"
  bottom:"conv2_2"
  top:"conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu5"
  type:"ReLU"
  bottom:"conv3_1"
  top:"conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu6"
  type:"ReLU"
  bottom:"conv3_2"
  top:"conv3_2"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_2"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu7"
  type:"ReLU"
  bottom:"conv4_1"
  top:"conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu8"
  type:"ReLU"
  bottom:"conv4_2"
  top:"conv4_2"
}
layer {
  name: "drop4"
  type: "Dropout"
  bottom: "conv4_2"
  top: "conv4_2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_2"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu9"
  type:"ReLU"
  bottom:"conv5_1"
  top:"conv5_1"
}
layer {
  name: "conv5_2"
  type: "Convolution"
  bottom: "conv5_1"
  top: "conv5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu10"
  type:"ReLU"
  bottom:"conv5_2"
  top:"conv5_2"
}
layer {
  name: "drop5"
  type: "Dropout"
  bottom: "conv5_2"
  top: "conv5_2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
## upsample layer 1

layer {
	name: "upscore1"
	type: "Upsample"
	bottom: "conv5_2"
	top: "upscore1"
	upsample_param{
	scale: 2
	}
}

layer {
  name: "conv6"
  type: "Convolution"
  bottom: "upscore1"
  top: "conv6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 2
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}

layer{
  name:"relu11"
  type:"ReLU"
  bottom:"conv6"
  top:"conv6"
}

layer {
    name: 'crop1'
    type: 'Crop'
	bottom: 'conv6'
    bottom: 'conv4_2' 
    top: 'crop1'
    crop_param {
    axis: 2
    offset: 0
    offset: 0
  }
}
layer {
    name: "concat1"
    type: "Concat"
    bottom: "crop1"
    bottom: "conv4_2"
    top: "concat1"
    concat_param {
    axis: 1
  }
}
layer {
  name: "conv6_1"
  type: "Convolution"
  bottom: "concat1"
  top: "conv6_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu12"
  type:"ReLU"
  bottom:"conv6_1"
  top:"conv6_1"
}
layer {
  name: "conv6_2"
  type: "Convolution"
  bottom: "conv6_1"
  top: "conv6_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu13"
  type:"ReLU"
  bottom:"conv6_2"
  top:"conv6_2"
}

## upsample layer 2
layer {
	name: "upscore2"
	type: "Upsample"
	bottom: "conv6_2"
	top: "upscore2"
	upsample_param{
	scale: 2
	}
}

layer {
  name: "conv7"
  type: "Convolution"
  bottom: "upscore2"
  top: "conv7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 2
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}

layer{
  name:"relu14"
  type:"ReLU"
  bottom:"conv7"
  top:"conv7"
}

layer {
    name: 'crop2'
    type: 'Crop'
	bottom: 'conv7'
	bottom: 'conv3_2'
    top: 'crop2'
    crop_param {
    axis: 2
    offset: 0
    offset: 0
  }
}
layer {
    name: "concat2"
    type: "Concat"
    bottom: "crop2"
    bottom: "conv3_2"
    top: "concat2"
    concat_param {
    axis: 1
  }
}
layer {
  name: "conv7_1"
  type: "Convolution"
  bottom: "concat2"
  top: "conv7_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu15"
  type:"ReLU"
  bottom:"conv7_1"
  top:"conv7_1"
}
layer {
  name: "conv7_2"
  type: "Convolution"
  bottom: "conv7_1"
  top: "conv7_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu16"
  type:"ReLU"
  bottom:"conv7_2"
  top:"conv7_2"
}

## upsample layer 3
layer {
	name: "upscore3"
	type: "Upsample"
	bottom: "conv7_2"
	top: "upscore3"
	upsample_param{
	scale: 2
	}
}

layer {
  name: "conv8"
  type: "Convolution"
  bottom: "upscore3"
  top: "conv8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 2
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}

layer{
  name:"relu17"
  type:"ReLU"
  bottom:"conv8"
  top:"conv8"
}
layer {
    name: 'crop3'
    type: 'Crop'
	bottom: 'conv8'
	bottom: 'conv2_2'
	 
    top: 'crop3'
    crop_param {
    axis: 2
    offset: 0
    offset: 0
  }
}
layer {
    name: "concat3"
    type: "Concat"
    bottom: "crop3"
    bottom: "conv2_2"
    top: "concat3"
    concat_param {
    axis: 1
  }
}
layer {
  name: "conv8_1"
  type: "Convolution"
  bottom: "concat3"
  top: "conv8_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu18"
  type:"ReLU"
  bottom:"conv8_1"
  top:"conv8_1"
}
layer {
  name: "conv8_2"
  type: "Convolution"
  bottom: "conv8_1"
  top: "conv8_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu19"
  type:"ReLU"
  bottom:"conv8_2"
  top:"conv8_2"
}

## upsample layer 4
layer {
	name: "upscore4"
	type: "Upsample"
	bottom: "conv8_2"
	top: "upscore4"
		upsample_param{
	scale: 2
	}
}

layer {
  name: "conv9"
  type: "Convolution"
  bottom: "upscore4"
  top: "conv9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 2
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}

layer{
  name:"relu20"
  type:"ReLU"
  bottom:"conv9"
  top:"conv9"
}
layer {
    name: 'crop4'
    type: 'Crop'
	bottom: 'conv9'
    bottom: 'conv1_2'	
    top: 'crop4'
    crop_param {
    axis: 2
    offset: 0
    offset: 0
  }
}
layer {
    name: "concat4"
    type: "Concat"
    bottom: "crop4"
    bottom: "conv1_2"
    top: "concat4"
    concat_param {
    axis: 1
  }
}
layer {
  name: "conv9_1"
  type: "Convolution"
  bottom: "concat4"
  top: "conv9_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu21"
  type:"ReLU"
  bottom:"conv9_1"
  top:"conv9_1"
}

layer {
  name: "conv9_2"
  type: "Convolution"
  bottom: "conv9_1"
  top: "conv9_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}
layer{
  name:"relu22"
  type:"ReLU"
  bottom:"conv9_2"
  top:"conv9_2"
}
layer {
  name: "conv9_3"
  type: "Convolution"
  bottom: "conv9_2"
  top: "conv9_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"msra"
      
    }
  }
}
layer{
  name:"relu23"
  type:"ReLU"
  bottom:"conv9_3"
  top:"conv9_3"
}


layer {
  name: "score"
  type: "Convolution"
  bottom: "conv9_3"
  top: "score"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    pad: 0
    kernel_size: 1
    weight_filler{
      type:"msra"
      std:0.01
    }
  }
}

layer {
    name: 'crop5'
    type: 'Crop'
	bottom: 'score'
    bottom: 'mask'   
    top: 'crop5'
    crop_param {
    axis: 2

  }
}


layer {
  name: "loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "crop5"
  bottom: "mask"
  top: "loss"
  #propagate_down: 1
  #propagate_down: 0
  #loss_weight: 1 
  #loss_param: {
  #  normalize: 1
  #} 
}
